db/app/controllers/movies_controller.rb

  def index

    needToRedirect = false
    if params[:sort_by] == nil
      if session[:sort_by] != nil
        @sorted_field = session[:sort_by].to_s
        needToRedirect = true
      end
    else
      @sorted_field = params[:sort_by].to_s
    end

    if @sorted_field != nil
      session.merge!({ :sort_by => @sorted_field })
    end

    if needToRedirect == true
      newParams = Hash.new
      newParams.merge!({ :ratings => @checked_ratings_hash })
      newParams.merge!({ :sort_by => @sorted_field })
      redirect_to movies_path(newParams)
    end

    @movies = Movie.all(:order => @sorted_field)
---
SELECT "movies".* FROM "movies" WHERE "rating"."order" = 'release_date'