app/controllers/movies_controller.rb

def index
    #Array of all possible ratings (for our class)
    @all_ratings = ['G','PG','PG-13', 'R']

    #If sort_param is blank (nothing is "hilited"), use previous sorting method. Else use currently set sorting (param)
    session[:sort_by] = (params[:sort].blank? ? session[:sort_by] : params[:sort])

    #If sort_param is blank (nothing checked), repeast the last entry. Else use current set of checkboxes (param)
    session[:ratings] = (params[:ratings].blank? ? session[:ratings] : params[:ratings].keys)

    #Get all movies where rating (sort by ratings item), order within ratings by (sort_by) from 0-9/a-z
    @movies = Movie.where(:rating => session[:ratings]).order("#{session[:sort_by]} ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG- 13', 'NC-17', 'R') ORDER BY release_date